#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.legacy-vpc: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
aws_iam_role.legacy_eks_role: Refreshing state... [id=dev-legacy-eks-role]
aws_iam_role.legacy_eks-worker_role: Refreshing state... [id=dev-legacy-eks-worker-role]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-legacy-eks-role-20231008141701210000000004]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-legacy-eks-worker-role-20231008141701294600000006]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-legacy-eks-worker-role-20231008141701086700000002]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-legacy-eks-worker-role-20231008141701258500000005]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-legacy-eks-worker-role-20231008141701138700000003]
data.aws_vpc.legacy-vpc: Read complete after 1s [id=vpc-0c972480e791df4a8]
data.aws_subnets.eks_subnets: Reading...
aws_route53_zone.private-zone: Refreshing state... [id=Z0083704RSELG1SUT0RD]
data.aws_subnets.eks_subnets: Read complete after 0s [id=us-east-1]
aws_eks_cluster.eks: Refreshing state... [id=dev-master-cluster]
data.aws_security_group.eks-cluster-sg: Reading...
aws_eks_node_group.node-group-0: Refreshing state... [id=dev-master-cluster:dev-master-node-group-0]
aws_eks_addon.example: Refreshing state... [id=dev-master-cluster:vpc-cni]
aws_eks_node_group.node-group-1: Refreshing state... [id=dev-master-cluster:dev-master-node-group-1]
data.aws_security_group.eks-cluster-sg: Read complete after 0s [id=sg-001a5f717cdaa2dff]
aws_vpc_endpoint.vpce["ec2"]: Refreshing state... [id=vpce-00de686f82e7a8af7]
aws_vpc_endpoint.vpce["ssmmessages"]: Refreshing state... [id=vpce-0b23cc6cacc19294f]
aws_vpc_endpoint.vpce["eks"]: Refreshing state... [id=vpce-0ba55b381201303ff]
aws_vpc_endpoint.vpce["ssm"]: Refreshing state... [id=vpce-0f4ebd661cfd7f02d]
aws_vpc_endpoint.vpce["ec2messages"]: Refreshing state... [id=vpce-0c96ddf6bb32af5ed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eks_addon.example will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-master-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-legacy-eks-worker-role"
    }

  # aws_route53_zone.private-zone will be created
  + resource "aws_route53_zone" "private-zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.master.legacy.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0c972480e791df4a8"
          + vpc_region = (known after apply)
        }
    }

  # aws_vpc_endpoint.vpce["ec2"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-001a5f717cdaa2dff",
        ]
      + service_name          = "com.amazonaws.us-east-1.ec2"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ec2"
        }
      + tags_all              = {
          + "Name"        = "vpce-ec2"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-001a5f717cdaa2dff",
        ]
      + service_name          = "com.amazonaws.us-east-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ec2messages"
        }
      + tags_all              = {
          + "Name"        = "vpce-ec2messages"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["eks"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-001a5f717cdaa2dff",
        ]
      + service_name          = "com.amazonaws.us-east-1.eks"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-eks"
        }
      + tags_all              = {
          + "Name"        = "vpce-eks"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["ssm"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "vpce" {
        id                    = "vpce-0f4ebd661cfd7f02d"
      ~ subnet_ids            = [
          + "subnet-0e3de7ff36b886018",
            # (1 unchanged element hidden)
        ]
        tags                  = {
            "Name" = "vpce-ssm"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.vpce["ssmmessages"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-001a5f717cdaa2dff",
        ]
      + service_name          = "com.amazonaws.us-east-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ssmmessages"
        }
      + tags_all              = {
          + "Name"        = "vpce-ssmmessages"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @benhur-sre, Action: `pull_request`, Working Directory: ``, Workflow: `scaffold-development`*